#+TITLE: dotemacs

* Set package archives

  #+begin_src emacs-lisp
(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                         ("melpa" . "http://melpa.org/packages/")
                         ("melpa-stable" . "http://stable.melpa.org/packages/")
                         ("org" . "http://orgmode.org/elpa/")))
  #+end_src

  #+RESULTS:
  : ((gnu . http://elpa.gnu.org/packages/) (melpa . http://melpa.org/packages/) (melpa-stable . http://stable.melpa.org/packages/) (org . http://orgmode.org/elpa/))

** Basics

I just want a clean look.

#+begin_src emacs-lisp
  (setq inhibit-startup-screen t)
    (when window-system
     (blink-cursor-mode 0) ; Disable cursor blinking
     (menu-bar-mode -1)     ; No menu bar
     (toggle-scroll-bar -1) ; No scroll bar
     (fringe-mode 0)        ; No fringe
     (tool-bar-mode -1)     ; No tool bar
    )

  (setq initial-frame-alist
        '(
          (vertical-scroll-bars . nil)
          (width . 90)
          (height . 35)
          ))

  (setq default-frame-alist
        '(
          (vertical-scroll-bars . nil)
          (width . 90)
          (height . 35)
          ))
#+end_src

#+RESULTS:
: ((vertical-scroll-bars) (width . 90) (height . 35))


Set the font

#+Begin_src emacs-lisp
;;(set-frame-font "Inconsolata 16" nil t)
(set-frame-font "DejaVu Sans Mono 16" nil t)
#+end_src

#+RESULTS:

Use visual line mode: don't worry about manually wrapping paragraphs anymore.

#+begin_src emacs-lisp
(add-hook 'text-mode-hook #'visual-line-mode)
#+end_src

#+RESULTS:
| (lambda nil (interactive) (message Olivetti text-mode-hook) (setq olivetti-body-width 81) (olivetti-mode 1)) | visual-line-mode | text-mode-hook-identify |

Vim scrolloff setting

#+begin_src emacs-lisp

(setq scroll-margin 4)

#+end_src

#+RESULTS:
: 4

** Mode line
   
I want a simple mode line.

#+begin_src emacs-lisp
  (setq-default mode-line-format '("%e" mode-line-front-space buffer-file-name))
#+end_src

#+RESULTS:
| %e | mode-line-front-space | buffer-file-name |

** Window movement keys
   
I like using =C-[dir key]= to move between split windows.  *Note*. This overwrites some default emacs things.  I don't care.

#+begin_src emacs-lisp
  ;; (eval-after-load "evil"
  ;;   '(progn
  ;;      (define-key evil-normal-state-map (kbd "C-h") #'evil-window-left)
  ;;      (define-key evil-normal-state-map (kbd "C-j") #'evil-window-down)
  ;;      (define-key evil-normal-state-map (kbd "C-k") #'evil-window-up)
  ;;      (define-key evil-normal-state-map (kbd "C-l") #'evil-window-right)
  ;;      (bind-key* (kbd "C-h") #'evil-window-left)
  ;;      (bind-key* (kbd "C-j") #'evil-window-down)
  ;;      (bind-key* (kbd "C-k") #'evil-window-up)
  ;;      (bind-key* (kbd "C-l") #'evil-window-right)
  ;;      )
  ;;   )
#+end_src

#+RESULTS:

*Update*. A better thing to do, perhaps, is the following.

#+begin_src emacs-lisp
  (eval-after-load "evil"
    '(progn
       (define-key evil-normal-state-map (kbd "C-h") #'evil-window-left)
       (define-key evil-normal-state-map (kbd "C-j") #'evil-window-down)
       (define-key evil-normal-state-map (kbd "C-k") #'evil-window-up)
       (define-key evil-normal-state-map (kbd "C-l") #'evil-window-right)
       (with-eval-after-load 'evil-maps
         '(progn
            (define-key evil-window-map (kbd "C-h") #'evil-window-left)
            (define-key evil-window-map (kbd "C-j") #'evil-window-down)
            (define-key evil-window-map (kbd "C-k") #'evil-window-up)
            (define-key evil-window-map (kbd "C-l") #'evil-window-right)
            )
         )
       )
    )
#+end_src

#+RESULTS:
| progn | (define-key evil-window-map (kbd C-h) #'evil-window-left) | (define-key evil-window-map (kbd C-j) #'evil-window-down) | (define-key evil-window-map (kbd C-k) #'evil-window-up) | (define-key evil-window-map (kbd C-l) #'evil-window-right) |
  

** Nice compilation buffer

I want the compilation buffer to just go away if there were no problems.

#+begin_src emacs-lisp
(setq compilation-finish-functions
      (lambda (buf str)
        (if (null (string-match ".*exited abnormally.*" str))
            ;; no errors, make the compilation window go away
            (progn
              (run-at-time
               "2 sec" nil 'delete-windows-on
               (get-buffer-create "*compilation*"))
              (message "No Compilation Errors!")))))
#+end_src

#+RESULTS:
| lambda | (buf str) | (if (null (string-match .*exited abnormally.* str)) (progn (run-at-time 2 sec nil 'delete-windows-on (get-buffer-create *compilation*)) (message No Compilation Errors!))) |

I want the compilation buffer to be small and always a 'split'.

#+begin_src emacs-lisp
(defun my/compile ()
    "Run compile and resize the compile window"
    (interactive)
    (progn
      (call-interactively 'compile)
      (setq cur (selected-window))
      (setq w (get-buffer-window "*compilation*"))
      (select-window w)
      (setq h (window-height w))
      (shrink-window (- h 10))
      (select-window cur)
      )
  )

;; I want compile buffer to always be a split
(setq split-height-threshold 0)
(setq split-width-threshold nil)
#+end_src

#+RESULTS:

** LaTeX preview
   
Just start up an org file in preview already.

#+begin_src emacs-lisp
(setq org-startup-with-latex-preview t)
#+end_src

#+RESULTS:
: t

Set the scale as shown to make the font size (set above) match the fragments well.

#+begin_src emacs-lisp
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.6))
#+end_src

#+RESULTS:
| :foreground | default | :background | default | :scale | 1.6 | :html-foreground | Black | :html-background | Transparent | :html-scale | 1.0 | :matchers | (begin $1 $ $$ \( \[) |

** Images

Show images when opening a file.

#+begin_src emacs-lisp
(setq org-startup-with-inline-images t)
#+end_src

#+RESULTS:
: t

Show images after evaluating code blocks

#+begin_src emacs-lisp
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)
#+end_src

#+RESULTS:
| org-display-inline-images |

